In [29]:
###########################################################################
#
# SQL-Challenge EmployeeSQL Bonus Dan C.
#
###########################################################################

from sqlalchemy import create_engine, inspect
from sqlalchemy.orm import Session
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey, func
from dotenv import load_dotenv, dotenv_values

import pandas as pd
import os

# Use the .env file and .gitignore to allow the connection string to be hidden from github
load_dotenv()
#DATABASE_URL = os.getenv("DATABASE_URL")
DATABASE_URL

'postgresql://postgres:postgres@localhost:5432/emp1'

In [30]:
engine = create_engine(os.getenv("DATABASE_URL"))
connection = engine.connect()

In [31]:
inspector = inspect(engine)
inspector.get_table_names()

['departments', 'dept_manager', 'dept_emp', 'employees', 'salaries', 'titles']

In [32]:
session = Session(engine)
#results = session.query(Emoji.emoji_char, Emoji.emoji_id, Emoji.score).order_by(Emoji.score.desc()).all()

In [39]:
#result = connection.execute("SELECT * from titles")
#result = connection.execute("select t.title, min(s.salary), max(s.salary), round(avg(s.salary)) \
#  into temp tmp_result \
#  from salaries s                                                         \
#  inner join employees em on em.emp_no = s.emp_no                         \
#  inner join titles t on t.title_id = em.emp_title_id                     \
#  group by t.title_id")           
#df = pd.read_sql_table("tmp_result",engine)
#result.fetchone()
#result
#for res in result
#df

In [44]:
titles = pd.read_sql_table("titles",engine)
titles

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [43]:
salaries = pd.read_sql_table("salaries",engine)
#titles
salaries

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [45]:
employees = pd.read_sql_table("employees",engine)
employees.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [22]:
session.close()